//
//  SonekiQuestionSequenceController.m
//  ShiwakeTrainingClass3
//
//  Created by Hiroaki Fujisawa on 2013/01/25.
//  Copyright (c) 2013年 Hiroaki Fujisawa. All rights reserved.
//

#import "SonekiQuestionSequenceController.h"

@implementation SonekiQuestionSequenceController

- (id)init
{
	self = [super init];
	if (self != nil) {
		
		// create Question data array
		
		#define QESTION_DATA_NUMBER		84
		
		QuestionStr QuestionData[QESTION_DATA_NUMBER] =
		{
            { "仕入" , 0},
            { "売上原価" , 0},
            { "給料" , 0},
            { "旅費交通費" , 0},
            { "発送費" , 0},
            { "租税公課" , 0},
            { "修繕費" , 0},
            { "貸倒損失" , 0},
            { "減価償却費" , 0},
            { "支払地代" , 0},
            { "支払家賃" , 0},
            { "売上割引" , 0},
            { "支払利息" , 0},
            { "手形売却損" , 0},
            { "支払手数料" , 0},
            { "有価証券売却損" , 0},
            { "有価証券評価損" , 0},
            { "のれん償却" , 0},
            { "雑損" , 0},
            { "棚卸減耗損" , 0},
            { "商品評価損" , 0},
            { "固定資産売却損" , 0},
            { "固定資産除去損" , 0},
            { "固定資産廃棄損" , 0},
            { "火災損失" , 0},
            { "法人税等" , 0},
            { "貸倒引当金繰入" , 0},
            { "退職給付費用" , 0},
            { "修繕引当金繰入" , 0},
            { "商品保証引当金繰入" , 0},
            { "売上割戻引当金繰入" , 0},
            { "役員賞与引当金繰入" , 0},
            { "広告宣伝費" , 0},
            { "通信費" , 0},
            { "消耗品費" , 0},
            { "水道光熱費" , 0},
            { "保険料" , 0},
            { "雑費" , 0},
            { "保管費" , 0},
            { "役務原価" , 0},
            { "賞与" , 0},
            { "返品調整引当金繰入" , 0},
            { "研究開発費" , 0},
            { "ソフトウェア償却" , 0},
            { "特許権償却" , 0},
            { "支払リース料" , 0},
            { "創立費" , 0},
            { "株式交付費" , 0},
            { "開業費" , 0},
            { "開発費" , 0},
            { "電子記録債権売却損" , 0},
            { "投資有価証券売却損" , 0},
            { "固定資産圧縮損" , 0},
            { "法人税住民税及び事業税" , 0},
            { "追徴法人税等" , 0},
            { "還付法人税等" , 0},
            { "仕入割戻" , 0},
            
            { "売上" , 1},
            { "仕入割引" , 1},
            { "受取地代" , 1},
            { "受取家賃" , 1},
            { "有価証券利息" , 1},
            { "受取利息" , 1},
            { "受取配当金" , 1},
            { "有価証券売却益" , 1},
            { "雑益" , 1},
            { "固定資産売却益" , 1},
            { "保険差益" , 1},
            { "受取手数料" , 1},
            { "有価証券評価益" , 1},
            { "商品売買益" , 1},
            { "貸倒引当金戻入" , 1},
            { "償却債権取立益" , 1},
            { "役務収益" , 1},
            { "投資有価証券売却益" , 1},
            { "負ののれん発生益" , 1},
            { "修繕引当金戻入" , 1},
            { "商品保証引当金戻入" , 1},
            { "返品調整引当金戻入" , 1},
            { "売上割戻引当金戻入" , 1},
            { "固定資産受贈益" , 1},
            { "国庫補助金受贈益" , 1},
            { "工事負担金受贈益" , 1},
            { "売上割戻" , 1}
		};
		
		NSArray *kamoku = [NSArray arrayWithObjects:@"費用", @"収益", nil];
		
		[self initData:QuestionData numberOfData:QESTION_DATA_NUMBER kamokuName:kamoku];
	}
	return self;
}

@end
